Revit 2027 API
ParameterTypeId.BoundaryRestraintZ Property
 "Z Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryRestraintZ { get; }
Public Shared ReadOnly Property BoundaryRestraintZ As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryRestraintZ {
	ForgeTypeId^ get ();
}
static member BoundaryRestraintZ : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace